{
  "content": [
    {
      "title": "Enhancing Rehabilitation: MS and Stroke Intervention Solutions",
      "brief_description": "\u003cb\u003eVideo Runtime: 58 Minutes; Learning Assessment Time: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis dynamic course is tailored for physical and occupational therapists seeking to enhance their clinical expertise in neurological rehabilitation through a comprehensive examination of two prevalent conditions: multiple sclerosis (MS) and stroke. With a focus on integrating evidence-based interventions into clinical practice, participants will gain valuable insights into the progression of treating patients from acute care to the outpatient setting while emphasizing the incorporation of intensity and motor learning strategies rooted in the OPTIMAL theory.\n\u003cbr\u003e\u003cbr\u003e\nThroughout the course, participants will learn to prioritize interventions that can be readily implemented in their clinical settings starting from the following week. A central focus of the course will be on leveraging intensity and motor learning principles based on the OPTIMAL theory to optimize rehabilitation outcomes for patients with MS and stroke.\n\u003cbr\u003e\u003cbr\u003e\nThis course promises to empower therapists to deliver impactful rehabilitation interventions that optimize functional outcomes and enhance the quality of life for individuals living with MS and stroke.\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDiscriminate MS and stroke, focusing on their neurological deficits and functional impairments\n\u003c/li\u003e\n\u003cli\u003eAnalyze both intensity and the OPTIMAL theory’s role in rehabilitation for MS and stroke patients\n\u003c/li\u003e\n\u003cli\u003ePrioritize acute care/inpatient interventions for immediate integration\n\u003c/li\u003e\n\u003cli\u003eApply environmental adjustments to optimize intensity for MS and CVA patients and ensure increased participation in daily activities\n\u003c/li\u003e\n\u003cli\u003eSelect outpatient interventions for immediate integration\n\u003c/li\u003e\n\u003cli\u003eImplement environmental adjustments for intensity optimization in outpatient settings to ensure increased participation in daily activities\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4637/atitle_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        }
      ]
    }
  ]
}