{
  "content": [
    {
      "id": 4637,
      "title": "Enhancing Rehabilitation: MS and Stroke Intervention Solutions",
      "brief_description": "\u003cb\u003eVideo Runtime: 58 Minutes; Learning Assessment Time: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis dynamic course is tailored for physical and occupational therapists seeking to enhance their clinical expertise in neurological rehabilitation through a comprehensive examination of two prevalent conditions: multiple sclerosis (MS) and stroke. With a focus on integrating evidence-based interventions into clinical practice, participants will gain valuable insights into the progression of treating patients from acute care to the outpatient setting while emphasizing the incorporation of intensity and motor learning strategies rooted in the OPTIMAL theory.\n\u003cbr\u003e\u003cbr\u003e\nThroughout the course, participants will learn to prioritize interventions that can be readily implemented in their clinical settings starting from the following week. A central focus of the course will be on leveraging intensity and motor learning principles based on the OPTIMAL theory to optimize rehabilitation outcomes for patients with MS and stroke.\n\u003cbr\u003e\u003cbr\u003e\nThis course promises to empower therapists to deliver impactful rehabilitation interventions that optimize functional outcomes and enhance the quality of life for individuals living with MS and stroke.\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDiscriminate MS and stroke, focusing on their neurological deficits and functional impairments\n\u003c/li\u003e\n\u003cli\u003eAnalyze both intensity and the OPTIMAL theory’s role in rehabilitation for MS and stroke patients\n\u003c/li\u003e\n\u003cli\u003ePrioritize acute care/inpatient interventions for immediate integration\n\u003c/li\u003e\n\u003cli\u003eApply environmental adjustments to optimize intensity for MS and CVA patients and ensure increased participation in daily activities\n\u003c/li\u003e\n\u003cli\u003eSelect outpatient interventions for immediate integration\n\u003c/li\u003e\n\u003cli\u003eImplement environmental adjustments for intensity optimization in outpatient settings to ensure increased participation in daily activities\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4637/atitle_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        }
      ]
    },
    {
      "id": 4638,
      "title": "Potential Unleashed: iSCI and TBI Rehab",
      "brief_description": "\u003cb\u003eVideo Runtime: 52 Minutes; Learning Assessment Time: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nTailored for therapists seeking to advance their expertise in neurological rehabilitation, this dynamic course offers a comprehensive exploration of two prevalent conditions: incomplete spinal cord injury (iSCI) and traumatic brain injury (TBI). Participants will gain insights into treating patients in acute care and outpatient settings, emphasizing the integration of evidence-based interventions and focusing on incorporating intensity and motor learning strategies grounded in the OPTIMAL theory.\u003cbr\u003e\u003cbr\u003e\nThroughout the course, therapists will learn to prioritize interventions for immediate implementation, with a central focus on leveraging these principles to optimize rehabilitation outcomes and enhance the quality of life for individuals affected by iSCI and TBI.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExamine iSCI and TBI pathophysiology and clinical signs to inform targeted, intensity-focused rehabilitation strategies\n\u003c/li\u003e\n\u003cli\u003eAnalyze the OPTIMAL theory and its relevance in neurological rehabilitation for optimizing outcomes through intensity and motor learning principles\n\u003c/li\u003e\n\u003cli\u003ePrioritize interventions for immediate implementation in acute care and inpatient rehabilitation for iSCI and TBI\n\u003c/li\u003e\n\u003cli\u003eExamine environmental adjustments in acute care and inpatient rehabilitation to optimize intensity for iSCI and TBI patients’ specific needs and priorities to ensure increased participation in daily occupations\n\u003c/li\u003e\n\u003cli\u003eIntegrate interventions into outpatient rehabilitation, emphasizing prioritization and immediate application\n\u003c/li\u003e\n\u003cli\u003eAnalyze environmental modifications to enhance outpatient rehabilitation intensity, tailored to the unique needs of individuals with iSCI and TBI to ensure increased participation in daily occupations\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4638/btitle_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        }
      ]
    },
    {
      "id": 4641,
      "title": "The Science of Intensity in Dual-Task: Dosage, Novelty, and Modality",
      "brief_description": "\u003cb\u003eVideo Runtime: 71 Minutes; Learning Assessment Time: 34 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nWhy are some movements “automatic,” processed without direct and consistent conscious control, or even resistant to environmental distractions? This advanced course provides an applications-based translation of the evidence in dual-tasking for professionals tasked to create or re-create automaticity. Attendees will be well-positioned to help clients manage fall risk and improve ADL independence, conversation, MRADLs, and executive functions. \n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDesign treatment plans that include each of the four modalities of distraction in cognitive-motor interference\n\u003c/li\u003e\n\u003cli\u003ePrioritize the mode of distraction that each person will benefit from and engage with optimally in order to increase participation in daily activities\n\u003c/li\u003e\n\u003cli\u003eFormulate and progress treatment plans that include dual-task intervention with consideration for person, diagnosis, and response to care\n\u003c/li\u003e\n\u003cli\u003eDevelop person-specific dual-task tests to objectify function in mobility and ADLs\n\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4641/1283a_title2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Mike Studer"
        }
      ]
    },
    {
      "id": 4642,
      "title": "The Science of Intensity Across the Phenotypes of Parkinson’s Disease",
      "brief_description": "\u003cb\u003eVideo Runtime: 70 Minutes; Learning Assessment Time: 34 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nParkinson’s diseases are NOT all the same. This course will clarify the clinical subtypes (phenotypes) of PD and define the opportunities for intensity within the rehabilitative and disease management (wellness) of each, from tremor-dominant Parkinson’s disease (TD) through postural impairment gait disorder (PIGD) and including considerations of both nonmotor impairments and genotypes of young-onset PD (YOPD). Learners will be exposed to an action-packed and application-filled course that readies them for person-specific clinical success.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop examinations that are person and phenotype specific for PwPD in an effort to objectify function in mobility and in daily activities\n\u003c/li\u003e\n\u003cli\u003ePrioritize interventions that are person and phenotype specific for PwPD in an effort to ensure increased functional independence in mobility and participation in daily activities\n\u003c/li\u003e\n\u003cli\u003eCreate educational tools, including home programs, that are person and phenotype specific for PwPD\n\u003c/li\u003e\n\u003cli\u003eFormulate care plans around the nonmotor presentations of PwPD\n\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4642/title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Mike Studer"
        }
      ]
    },
    {
      "id": 4675,
      "title": "Home Health Excellence: Introduction to the Environment",
      "brief_description": "\u003cb\u003eVideo Runtime: 19 Minutes; Learning Assessment Time: 43 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nIn the rapidly evolving landscape of healthcare, skilled and compassionate home health clinicians are needed to impact healthcare in the home setting. This course is designed to take home health clinicians—nurses, aides, therapists, social workers, and home health leaders—on a journey toward excellence in care delivery. This course addresses why home healthcare is important in the continuum of care and discusses the core principles of tailoring patient-centered care to meet the unique needs and preferences of each individual, the power of interdisciplinary collaboration, and setting the stage for individualized patient care using the 4Ms framework. This course will equip the clinician with tools and insights that will ignite a movement toward compassionate, personalized care designed to improve patient outcomes, patient satisfaction, and clinician fulfillment.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eReview the importance and scope of home healthcare and  its role within the broader healthcare continuum \u003c/li\u003e\n\u003cli\u003eIdentify four key principles of home healthcare \u003c/li\u003e\n\u003cli\u003eCompare various roles of clinicians in home healthcare and their contributions to patient care \u003c/li\u003e\n\u003cli\u003eLearn from committed home care clinicians why they chose home health and the value of healthcare in the home\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4675/c1274a_tate_venable_ch200_02_42_07still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4677,
      "title": "Home Health Excellence: Comprehensive Homecare Assessment Part 1",
      "brief_description": "\u003cb\u003eVideo Runtime: 23 Minutes; Learning Assessment Time: 40 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course is designed to provide home health clinicians with the knowledge and skills necessary to perform thorough and effective patient assessments. This series delves into the essentials of conducting comprehensive assessments, emphasizing the importance of a thorough and complete assessment and the importance of utilizing the 4Ms framework—what matters, mobility, mentation, and medication. Clinicians will learn to integrate patient-centered care practices to ensure individualized and realistic goal setting that enhances patient outcomes. This series delves into the essentials of conducting comprehensive assessments, emphasizing the importance of utilizing the 4Ms framework—what matters, mobility, mentation, and medication.\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDefine the comprehensive homecare assessment within the context of holistic patient care\u003c/li\u003e\n\u003cli\u003eRecognize how comprehensive assessments ensure compliance with healthcare standards to facilitate the development of individualized, patient-centered care plans\u003c/li\u003e\n\u003cli\u003eOutline the instructions and expectations for a patient’s first visit based on referral information and documentation\u003c/li\u003e\n\u003cli\u003eIdentify how each component of the 4Ms framework (what matters, mobility, mentation, and medication) can be integrated into comprehensive assessments\u003c/li\u003e\n\u003c/ul\u003e\n\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4677/c1274c_tate_venable_ch300_03_44_15still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4678,
      "title": "Home Health Excellence: Comprehensive Homecare Assessment Part 2",
      "brief_description": "\u003cb\u003eVideo Runtime: 32 Minutes; Learning Assessment Time: 56 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nClinicians often face challenges in conducting comprehensive assessments that accurately reflect a patient-centered care plan, leading to suboptimal care plans and patient outcomes. This course provides home health clinicians with the necessary skills to perform detailed assessments in a patient’s home environment, covering key areas such as mobility, mentation, medication reconciliation, and the integumentary, cardiopulmonary/vascular, endocrine, genitourinary, and gastrointestinal systems. Through a combination of brief lectures and practical demonstrations, participants will learn to integrate the 4Ms framework and other essential assessment tools into their practice. This course is ideal for nurses, occupational therapists, and other home health professionals seeking to enhance their assessment capabilities and deliver patient-centered care. By improving the accuracy and comprehensiveness of assessments, clinicians can develop more effective, individualized care plans, improving patient outcomes and satisfaction.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify the key components of a comprehensive homecare assessment and the significance of a holistic, patient-centered care approach\u003c/li\u003e\n\u003cli\u003eList the steps involved in medication reconciliation and the review of neurological, cognitive, and psychosocial status\u003c/li\u003e\n\u003cli\u003eOutline the elements of a functional mobility/musculoskeletal assessment, including a room-to-room OASIS walk, environment evaluation, pain assessment, equipment needs, home safety, and fall risk assessment\u003c/li\u003e\n\u003cli\u003eLabel the key areas to assess in integumentary, cardiopulmonary/vascular, genitourinary, and endocrine systems\u003c/li\u003e\n\u003cli\u003eLabel the primary components of gastrointestinal assessments, including nutritional assessment and medical supplies evaluation\u003c/li\u003e\n\u003cli\u003eRecognize the importance of interdisciplinary collaboration and effective communication with other healthcare providers\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4678/c1274d_tate_venable_ch200_03_53_05still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4688,
      "title": "Home Health Excellence: Developing the Plan of Care",
      "brief_description": "\u003cb\u003eVideo Runtime: 21 Minutes; Learning Assessment Time: 48 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course addresses the need for home health clinicians to enhance their skills in creating individualized and patient-centered care plans. Participants will learn the key elements of the plan-of-care development, including identifying patient-specific interventions, setting measurable outcomes, and fostering interdisciplinary collaboration. By focusing on practical applications and regulatory compliance, this course prepares clinicians to deliver high-quality care tailored to each patient’s unique needs. The course is designed for home health clinicians who perform home health admissions, plan of care update orders, resumption of care orders, and recertifications.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDefine the key elements of plan-of-care development\u003c/li\u003e\n\u003cli\u003eOutline how the plan of care serves as a road map for care delivery\u003c/li\u003e\n\u003cli\u003eIdentify patient-specific interventions based on comprehensive assessment data and specific physician/practitioner orders\u003c/li\u003e\n\u003cli\u003eList measurable outcomes and goals for the plan of care\u003c/li\u003e\n\u003cli\u003eRecognize the impact of an accurate plan of care on skilled care delivery\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4688/c1274e_tate_venable_ch200_03_56_03still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4689,
      "title": "Home Health Excellence: Care Coordination and Collaboration",
      "brief_description": "\u003cb\u003eVideo Runtime: 20 Minutes; Learning Assessment Time: 42 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nIn the dynamic landscape of home healthcare, effective care coordination, interdisciplinary collaboration, and meticulous documentation are paramount for ensuring optimal patient outcomes and regulatory compliance. This course delves into the core principles and best practices essential for addressing these critical aspects. Participants will explore the significance of care coordination in home health, understanding its pivotal role in enhancing quality of care, increasing patient satisfaction, and streamlining care delivery. Through insightful discussions, they will grasp the intricacies of interdisciplinary care coordination, learning how various healthcare professionals synergize their efforts to adhere to comprehensive care plans tailored to individual patient needs. The course sheds light on the key elements that should be documented to ensure continuity of care and compliance with CMS regulations. Participants will emerge equipped with practical strategies and actionable insights to elevate their care coordination practices, foster interdisciplinary collaboration, and uphold documentation standards.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize the importance of care coordination in the home health setting \u003c/li\u003e\n\u003cli\u003eCompare interdisciplinary team members and recognize interdisciplinary care coordination \u003c/li\u003e\n\u003cli\u003eIdentify best practices for demonstrating care coordination in documentation\u003c/li\u003e\n\u003cli\u003eIdentify interdisciplinary collaboration strategies regarding patient and clinician safety\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4689/c1274f_tate_venable_ch300_01_30_24still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4690,
      "title": "Home Health Excellence: Best Practices for Home Visits",
      "brief_description": "\u003cb\u003eVideo Runtime: 19 Minutes; Learning Assessment Time: 47 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nIn today’s dynamic healthcare environment, effective home visits are essential for ensuring high-quality patient care. This course is designed to equip home health clinicians with the knowledge and skills needed to conduct successful home visits. The course addresses common challenges such as inadequate preparation, ineffective patient interaction, and poor follow-up practices that can compromise outcomes. Participants will learn the importance of home visits and how to prepare comprehensively, perform thorough and compassionate patient assessments, and execute follow-up procedures that enhance continuity of care. By adopting these best practices, clinicians will improve patient satisfaction, reduce hospital admissions, and ensure better health outcomes.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize the importance of an effective home visit in home healthcare \u003c/li\u003e\n\u003cli\u003eIdentify how to adequately prepare for a home visit to ensure compliance\u003c/li\u003e\n\u003cli\u003eHighlight key components of a home visit, including infection control and skilled intervention\u003c/li\u003e\n\u003cli\u003eList proper follow-up procedures and plan for subsequent visits\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4690/c1274g_tate_venable_ch200_00_56_25still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4691,
      "title": "Home Health Excellence: Communication and Patient Engagement",
      "brief_description": "\u003cb\u003eVideo Runtime: 14 Minutes; Learning Assessment Time: 49 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nEffective communication and patient engagement are critical components of quality care in the home health setting. This course provides home healthcare professionals with essential skills and knowledge to improve interactions with patients and their families. The course covers four key areas: effective communication techniques, cultural competency, patient education strategies, and addressing psychosocial needs. Additionally, it offers practical approaches to patient education, ensuring that health information is accessible and understandable. By the end of this course, participants will be better prepared to foster positive patient relationships, enhance care quality, and improve patient outcomes and satisfaction in the home healthcare environment.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize effective communication techniques to engage with patients and their families \u003c/li\u003e\n\u003cli\u003eRecognize cultural competency and sensitivity in interactions with diverse patient populations \u003c/li\u003e\n\u003cli\u003eDefine effective patient education strategies and list appropriate resources to enhance patient understanding and engagement\u003c/li\u003e\n\u003cli\u003eHighlight the psychosocial needs and concerns of patients and their families to improve overall care and experience\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4691/c1274h_tate_venable_ch200_01_09_25still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4692,
      "title": "Home Health Excellence: Quality Improvement and Best Practices",
      "brief_description": "\u003cb\u003eVideo Runtime: 21 Minutes; Learning Assessment Time: 42 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course provides a comprehensive overview of quality improvement and best practices in home health, equipping participants with the knowledge and tools to enhance care delivery. By understanding and applying the principles of QAPI, leveraging patient feedback, implementing evidence-based practices, and utilizing quality metrics, home health professionals can significantly improve patient outcomes and overall care quality. By the end of the course, participants will be equipped with practical tools and knowledge to drive continuous improvement in their home health practice, ultimately leading to better patient outcomes and higher satisfaction. Whether you are new to home health or looking to refine your quality improvement strategies, this course provides valuable insights and actionable steps for advancing care quality.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDefine the principles and processes of Quality Assurance and Performance Improvement (QAPI) in home health \u003c/li\u003e\n\u003cli\u003eRecognize methods for assessing patient experience and feedback to enhance care quality \u003c/li\u003e\n\u003cli\u003eHighlight evidence-based care guidelines and best practices to improve patient outcomes\u003c/li\u003e\n\u003cli\u003eIdentify quality metrics and benchmarks to evaluate and improve outcomes in home health\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4692/c1274i_tate_venable_ch300_04_31_02still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4693,
      "title": "Home Health Excellence: Professional Development and Self-Care Strategies",
      "brief_description": "\u003cb\u003eVideo Runtime: 20 Minutes; Learning Assessment Time: 42 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nHome health clinicians are the backbone of compassionate and quality care. Their demanding schedules and the challenges they face in healthcare can often lead to high levels of stress and burnout. This course addresses this critical need by offering a unique blend of professional development and self-care strategies. Clinicians will gain valuable knowledge and skills relevant to advancing their skills in home health, while simultaneously learning practical techniques to manage stress, prioritize well-being, and build resilience. This course is specifically designed for home health professionals, empowering them to care for themselves and setting them up for success to deliver exceptional patient care and create a sustainable, fulfilling career path.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize the impact of professional development and self-care on personal and professional well-being \u003c/li\u003e\n\u003cli\u003eIdentify at least two opportunities for professional development and growth \u003c/li\u003e\n\u003cli\u003eIdentify at least two self-care practices to maintain both physical and emotional health\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4693/c1274j_ch1_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4695,
      "title": "Home Health Excellence: Case Management Part 2",
      "brief_description": "\u003cb\u003eVideo Runtime: 17 Minutes; Learning Assessment Time: 45 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nIn the home health industry, clinicians encounter challenges in managing resources efficiently, organizing their time effectively, and maintaining thorough documentation, which can lead to barriers in patient outcomes and operational inefficiencies. This course is designed to tackle these issues by providing knowledge and skills in resource management, time management, documentation practices, and continuous quality improvement. This course aims to enhance clinicians’ ability to deliver high-quality, patient-centered care while ensuring compliance with regulatory standards. By addressing these fundamental aspects, the course supports clinicians in improving patient outcomes and operational efficiency across various home health settings.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify strategies for effective resource management and patient/family engagement \u003c/li\u003e\n\u003cli\u003eSelect effective time management and organizational skills to prioritize tasks and responsibilities \u003c/li\u003e\n\u003cli\u003eSelect tips for effective communication in documentation\u003c/li\u003e\n\u003cli\u003eIdentify strategies for implementing quality improvement initiatives\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4695/c1274l_tate_venable_ch100_04_13_09still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    },
    {
      "id": 4696,
      "title": "Home Health Excellence: Putting Knowledge Into Practice",
      "brief_description": "\u003cb\u003eVideo Runtime: 16 Minutes; Learning Assessment Time: 46 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course explores the core principles of the home health industry, emphasizing best practices, regulatory compliance, and patient engagement. Participants will demonstrate the skills necessary to create individualized care plans through comprehensive assessments and informed interventions. The course delves into effective coordination and collaboration strategies within multidisciplinary teams for optimal patient outcomes. Participants will review quality improvement methodologies and best practices to maintain high standards of care and compliance. Finally, the course offers strategies for ongoing professional development, self-care, and effective case management, helping healthcare professionals thrive in their careers. Together, these chapters provide the knowledge and skills necessary to excel in delivering exceptional patient-centered home healthcare.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDefine core principles of the home health industry, including best practices, regulatory compliance, and patient engagement \u003c/li\u003e\n\u003cli\u003eHighlight the ability to coordinate and collaborate effectively within multidisciplinary teams for optimal patient outcomes \u003c/li\u003e\n\u003cli\u003eRecognize quality improvement methodologies and best practices to enhance patient care and outcomes\u003c/li\u003e\n\u003cli\u003eDefine key concepts of a thorough and holistic comprehensive assessment that drive compliance, informed patient care planning, and intervention\u003c/li\u003e\n\u003cli\u003eList strategies for ongoing professional development, self-care, and effective case management\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4696/c1274m_tate_venable_ch1300_00_01_17still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Kim Tate"
        },
        {
          "name_without_ending": "Natalie Venable"
        }
      ]
    }
  ]
}