{
  "content": [
    {
      "title": "How Can Poststroke Rehab Bridge the Gap Between Therapy and Real-Life Performance?",
      "brief_description": "\u003cb\u003eAudio Runtime: 54 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eNeuro Navigators Episode 9: How Can Poststroke Rehab Bridge the Gap Between Therapy and Real-Life Performance?\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nDr. Darcy Reisman, professor and chairperson of the department of physical therapy at the University of Delaware, joins host J.J. Mowder-Tinney for an engaging discussion on poststroke rehabilitation, with a focus on walking recovery. A true knowledge translator, Dr. Reisman shares her extensive research and outlines practical strategies for improving both clinical walking capacity and real-world walking performance. Tune in to discover how bridging the gap between research, therapy, and real life can help your patients achieve their walking goals both in and beyond the clinic.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eInterpret the evidence surrounding walking capacity vs. walking performance after stroke\u003c/li\u003e\n\u003cli\u003eApply evidence-based strategies to enhance walking recovery in poststroke patients\u003c/li\u003e\n\u003cli\u003eIncorporate motivational interviewing-type techniques and patient-centered goal setting in stroke rehabilitation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4710/1250ibanner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        },
        {
          "name_without_ending": "Darcy S. Reisman"
        },
        {
          "name_without_ending": "Jaimie Anderson"
        },
        {
          "name_without_ending": "Dana Aravich"
        }
      ]
    },
    {
      "title": "Do You Know the Top 5 Updates Orthopedic Rehab Providers Need to Know?",
      "brief_description": "\u003cb\u003eAudio Runtime: 56 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eRehab and Performance Lab Episode 9: Do You Know the Top 5 Updates Orthopedic Rehab Providers Need to Know? \u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nDr. Eric Robertson, PT, DPT, MFA, FAAOMPT, a leader in orthopedic physical therapy and education, joins Phil Plisky to explore the top five updates rehab providers need to know. Eric shares insights on how to implement the latest clinical practice guidelines, with practical strategies for improving patient care and clinical outcomes. \n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eInterpret the evidence around primary orthopedic physical therapist practice and conditions requiring referral\u003c/li\u003e\n\u003cli\u003eApply evidence-based, practical strategies to actionably address latest guideline-driven interventions for patients with musculoskeletal conditions\u003c/li\u003e\n\u003cli\u003eSolve patient case scenarios involving patients with musculoskeletal and orthopedic physical therapy conditions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4711/1252hbanner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Phil Plisky"
        },
        {
          "name_without_ending": "Eric Robertson"
        }
      ]
    },
    {
      "title": "The AFIT (Adult Functional Independence Test) for Optimal Aging",
      "brief_description": "\u003cb\u003eVideo Runtime: 285 Minutes; Learning Assessment Time: 19 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nWouldn’t it be great to have a performance-based functional assessment tool to be used with adults 50 years and older to evaluate the key aspects of functional fitness central to optimal aging: posture, flexibility, balance, endurance, and strength? \n\u003cbr\u003e\u003cbr\u003e\nThis course presents \u0026 demonstrates such a tool – The AFIT (Adult Functional Independence Test) for Optimal Aging. All of the measures that comprise The AFIT are supported by research and include predictive analytics; many include national norms.\n\u003cbr\u003e\u003cbr\u003e\nIt is our hope that The AFIT will be a mandatory component of annual physician visits. As one physician commented in our beta test, “I love this. Just like I order blood work, I can order the AFIT for each annual visit. This will provide me with vital information on my patient’s functional status that I don’t have time to get.”\n\u003cbr\u003e\u003cbr\u003e\nParticipants will learn the importance of these measures and observe how to correctly perform the assessment as well as explain the implications to their patients/clients. Evidence based exercises will be provided as suggested resources for the problems identified. The AFIT or parts of it can also be used as an initial, progress or discharge evaluation in most clinical settings.\n\u003cbr\u003e\u003cbr\u003e \nCourse participants will observe 3 case studies, which include counseling patients with regard to the appropriate course of action. Information on marketing this tool to physicians, health agencies, and the community is provided and practical, how-to handouts are included that the course participants can download and use immediately.\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eList the 15 assessments that comprise the Adult Functional Independence Test (AFIT)\u003c/li\u003e\n\u003cli\u003eDetermine the norms and cutoffs for each AFIT assessment to evaluate client functional status\u003c/li\u003e\n\u003cli\u003eAdminister AFIT assessments in a clinical setting\u003c/li\u003e\n\u003cli\u003eDetermine the implications of AFIT assessment results for promoting optimal aging.\u003c/li\u003e\n\u003cli\u003eList 15 exercises that address deficits identified through the AFIT\u003c/li\u003e\n\u003cli\u003eIdentify evidence supporting the use of each exercise for specific deficits identified by the AFIT\u003c/li\u003e\n\u003cli\u003eSelect an appropriate intervention based on AFIT results to enhance client independence in daily activities\u003c/li\u003e\n\u003cli\u003eChoose a marketing strategy for the medical and general community\u003c/li\u003e\n\u003cli\u003eIdentify effective strategies to motivate clients to adhere to prescribed home exercise/activity programs\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4701/title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Carole B. Lewis"
        }
      ]
    },
    {
      "title": "Physical Therapy for Multiple Sclerosis: Foundations and Evaluation",
      "brief_description": "\u003cb\u003eVideo Runtime: 55 Minutes; Learning Assessment Time: 38 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nMultiple sclerosis (MS) is an unpredictable neurodegenerative disease that can be challenging for providers to feel comfortable and confident in treating. The foundational concepts of this course apply for all rehabilitation providers treating patients with MS in inpatient, outpatient, skilled nursing, and home health settings. Therapists will benefit from information related to staging of MS, medical management, common signs and symptoms, and disease progression. This course will also address selection of special tests, outcome measures, and plan of care decision-making tools to optimize physical therapy evaluation.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDistinguish between the different types of MS to better provide individualized treatment for patients with MS \u003c/li\u003e\n\u003cli\u003eDiscriminate between different medical management options for patients with MS \u003c/li\u003e\n\u003cli\u003eConsider various signs and symptoms that commonly impact the well-being of patients with MS, and assess for these symptoms during PT evaluation\u003c/li\u003e\n\u003cli\u003eDetermine stage of MS, and deduce progression of the course of the disease over time for patients with MS\u003c/li\u003e\n\u003cli\u003eDevelop appropriate PT evaluation, including specific tests and measures for people with MS\u003c/li\u003e\n\u003cli\u003ePrioritize optimal outcome measure selection for patients with MS based upon stage of MS and their functional mobility\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4534/c1236a_czejkowski_nixon_ch300_11_42_17still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Audrey Czejkowski"
        },
        {
          "name_without_ending": "Elizabeth Nixon"
        }
      ]
    },
    {
      "title": "Physical Therapy for Multiple Sclerosis: Symptom Management",
      "brief_description": "\u003cb\u003eVideo Runtime: 67 Minutes; Learning Assessment Time: 32 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nMultiple sclerosis (MS) is an unpredictable neurodegenerative disease that can be challenging for providers to feel comfortable and confident in treating. Individuals with MS experience a wide variety of symptoms; this course focuses on the management of several of the more complex symptoms that are commonly found in patients with MS. The concepts of this course apply for all rehabilitation providers treating patients with MS in inpatient, outpatient, skilled nursing, and home health settings.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecommend optimal methods to manage fatigue and heat sensitivity for patients with multiple sclerosis (MS) \u003c/li\u003e\n\u003cli\u003eConsider factors that contribute to spasticity, and recognize short-term vs. long-term management options for patients with MS \u003c/li\u003e\n\u003cli\u003eDistinguish between different types of pain common in patients with MS and the use of conservative interventions for mitigating pain\u003c/li\u003e\n\u003cli\u003eEvaluate types of dizziness and strategies for rehabilitation for patients with MS\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4535/c1236b_czejkowski_nixon_ch200_09_26_22still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Audrey Czejkowski"
        },
        {
          "name_without_ending": "Elizabeth Nixon"
        }
      ]
    },
    {
      "title": "Physical Therapy for Multiple Sclerosis: Intervention Recommendations",
      "brief_description": "\u003cb\u003eVideo Runtime: 56 Minutes; Learning Assessment Time: 38 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nMultiple sclerosis (MS) is an unpredictable neurodegenerative disease that can be challenging for providers to feel comfortable and confident in treating. Therapists will benefit from specific evidence-based exercise recommendations and intervention ideas for patients with various mobility impairments (mild, moderate, and severe) and provide guidance on education throughout the course of the disease. This course's concepts apply to all physical therapists treating patients with MS in inpatient, outpatient, skilled nursing, and home health settings.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIntegrate evidence-based exercise recommendations, including high-intensity activities for patients in early, middle, and late stages of MS \u003c/li\u003e\n\u003cli\u003eDevelop appropriate equipment recommendations for patients in the middle and late stages of MS \u003c/li\u003e\n\u003cli\u003eDetermine optimal interventions for patients across all stages of MS\u003c/li\u003e\n\u003cli\u003eConstruct individualized patient education across the course of the disease progression\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4536/c1236c_czejkowski_nixon_ch100_07_16_15still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Audrey Czejkowski"
        },
        {
          "name_without_ending": "Elizabeth Nixon"
        }
      ]
    },
    {
      "title": "Navigating the Good Faith Estimate for Outpatient Therapy Services",
      "brief_description": "\u003cb\u003eVideo Runtime: 68 Minutes; Learning Assessment Time: 43 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course will teach participants what the good faith estimate (GFE) is, which insurance carriers and patients the GFE applies to, how it applies to cash-based therapy practices, and what the required elements of a GFE are. It will also explain the patient–provider dispute resolution process.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eApply the various definitions associated with §149.610 requirements for provision of good faith estimates of expected charges for uninsured (or self-pay) individuals\n\u003c/li\u003e\n\u003cli\u003eChoose the timeframes in which a GFE must be provided to an individual\n\u003c/li\u003e\n\u003cli\u003eDetermine the required elements that must be included in a good faith estimate\n\u003c/li\u003e\n\u003cli\u003eSolve how a GFE can be delivered to an uninsured/self-pay individual\n\u003c/li\u003e\n\u003cli\u003eApply the patient–provider dispute resolution process\n\u003c/li\u003e\n\u003cli\u003eDistinguish situations when a GFE may need to be issued to a patient inquiring about and/or receiving outpatient therapy services\n\u003c/li\u003e\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4600/title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rick Gawenda"
        }
      ]
    },
    {
      "title": "How to Use the ABN for Outpatient Therapy Services",
      "brief_description": "\u003cb\u003eVideo Runtime: 53 Minutes; Learning Assessment Time: 46 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nOften, therapists and assistants do not know when to and when not to issue an Advance Beneficiary Notice of Noncoverage (ABN) to a Medicare beneficiary. In addition, they do not understand how to properly complete an ABN and append the applicable modifier on the CPT code(s) on the claim form.\n\u003cbr\u003e\u003cbr\u003e\nThis course will teach participants when to and when not to issue an ABN to a Medicare beneficiary, how to correctly complete and issue an ABN, when they can collect funds from a Medicare beneficiary, and limitations of the ABN for Medicare beneficiaries who are enrolled in the Qualified Medicare Beneficiary Program.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify three examples of when an ABN would be appropriate to issue to a Medicare beneficiary\n\u003c/li\u003e\n\u003cli\u003eList how an ABN can be delivered to a Medicare beneficiary\n\u003c/li\u003e\n\u003cli\u003eState how to complete the ABN form\n\u003c/li\u003e\n\u003cli\u003eList three examples of when an ABN would not be appropriate to issue to a Medicare beneficiary\n\u003c/li\u003e\n\u003cli\u003eRecall how long you must maintain the ABN\n\u003c/li\u003e\n\u003cli\u003eIdentify how long an ABN can be valid\n\u003c/li\u003e\n\u003cli\u003eConclude when you can collect funds from a Medicare beneficiary who has signed an ABN\n\u003c/li\u003e\n\u003cli\u003eRecall the modifiers associated with the ABN\n\u003c/li\u003e\n\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4601/title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rick Gawenda"
        }
      ]
    },
    {
      "title": "Introduction to the PT Evaluation Codes",
      "brief_description": "\u003cb\u003eVideo Runtime: 51 Minutes; Learning Assessment Time: 19 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course will teach participants the definitions of key words associated with the physical therapy evaluation CPT codes to enable them to select the appropriate physical therapy evaluation CPT code based on complexity. In addition, the course will teach participants how to correctly identify and list what elements were addressed during the examination portion of the physical therapy evaluation.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecall definitions associated with the PT evaluation CPT codes\n\u003c/li\u003e\n\u003cli\u003eList the eight chapters associated with body structures per the ICF\n\u003c/li\u003e\n\u003cli\u003eName the eight chapters associated with body functions per the ICF\n\u003c/li\u003e\n\u003cli\u003eIdentify activity limitations and participation restrictions a patient may have due to their diagnosis/condition\n\u003c/li\u003e\n\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4602/title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rick Gawenda"
        }
      ]
    },
    {
      "title": "The Medicare Annual Therapy Dollar Threshold and MPPR",
      "brief_description": "\u003cb\u003eVideo Runtime: 41 Minutes; Learning Assessment Time: 22 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nTherapists and assistants often do not understand the Medicare annual therapy dollar threshold, how it is calculated, and when to use the KX modifier. In addition, they do not understand the Multiple Procedure Payment Reduction (MPPR) policy.\n\u003cbr\u003e\u003cbr\u003e\nThis course will teach participants about the Medicare annual therapy dollar threshold and the targeted medical review process. In addition, this course will teach participants the MPPR and its impact on payment, its effect on the annual therapy cap dollar threshold, and how payment is reduced when a Medicare beneficiary is seen by one, two, or all three disciplines on the same date of service.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eList which settings the Medicare annual therapy dollar threshold applies to\n\u003c/li\u003e\n\u003cli\u003eConclude the annual therapy dollar threshold and targeted medical review threshold amounts and what amount counts toward the annual therapy dollar threshold\n\u003c/li\u003e\n\u003cli\u003eName the criteria that is used to select claims that have exceeded the targeted medical review dollar threshold\n\u003c/li\u003e\n\u003cli\u003eConclude which relative value unit the Multiple Procedure Payment Reduction (MPPR) policy impacts\n\u003c/li\u003e\n\u003cli\u003eRecognize the claim adjustment reason code identifying the MPPR\n\u003c/li\u003e\n\u003cli\u003eRecall the percent reduction of the practice expense relative value unit under MPPR\n\u003c/li\u003e\n\n\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4603/dtitle_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rick Gawenda"
        }
      ]
    },
    {
      "title": "PT Evaluation Codes: Case Scenarios",
      "brief_description": "\u003cb\u003eVideo Runtime: 65 Minutes; Learning Assessment Time: 26 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nUsing case scenarios in pediatrics, neurology, and orthopedics, this course will teach participants how to determine the appropriate complexity level for a PT evaluation and the documentation that must be present in the medical record to support their choice.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify the correct evaluation code based on evaluation findings and documentation \n\u003c/li\u003e\n\u003cli\u003eCompare examples of stable, evolving and changing, and unstable and unpredictable clinical presentations\n\u003c/li\u003e\n\u003cli\u003eRecognize how comorbidities and personal factors can impact the level of PT evaluation selected\n\u003c/li\u003e\n\u003cli\u003eClarify how time impacts the level of complexity of a PT evaluation\n\u003c/li\u003e\n\u003cli\u003eList the four components of a PT evaluation\n\u003c/li\u003e\n\n\n\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4605/ftitle2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rick Gawenda"
        }
      ]
    },
    {
      "title": "Geriatric Practice: Screening for Cardiopulmonary Compromise",
      "brief_description": "\u003cb\u003eVideo Runtime: 41 Minutes; Learning Assessment Time: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nAs healthcare evolves, physical therapists are increasingly encountering patients with complex cardiopulmonary conditions, necessitating a deeper understanding and precise management skills. This course is designed to address the critical need for enhanced screening and referral capabilities in physical therapy, particularly in the context of cardiopulmonary care. Physical therapists will learn to identify signs and symptoms that may fall outside the scope of their practice and require intervention from other healthcare professionals. This proactive approach is crucial in preventing missed diagnoses and ensuring comprehensive patient care. The course is for physical therapists working across various settings who wish to augment their expertise in cardiopulmonary physical therapy and improve patient outcomes through effective interprofessional collaboration.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eImplement an effective referral plan that ensures seamless transitions for patients between physical therapists and other healthcare professionals\n\u003c/li\u003e\n\u003cli\u003eExamine the pathophysiology, symptoms, and progression of common cardiopulmonary conditions to enhance diagnosis accuracy and tailor intervention strategies effectively\n\u003c/li\u003e\n\u003cli\u003eDetermine when a patient’s cardiopulmonary signs or symptoms exceed the scope of physical therapy and necessitate intervention from other healthcare professionals\n\u003c/li\u003e\n\u003cli\u003eExamine case studies to identify common red flags and patterns in cardiopulmonary conditions that may necessitate referral or further medical evaluation\n\u003c/li\u003e\n\u003cli\u003eEvaluate patient history and examination results to discern underlying cardiopulmonary issues that could impact treatment outcomes and overall health\n\u003c/li\u003e\n\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4611/atite_2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Ray VanWye"
        }
      ]
    },
    {
      "title": "Geriatric Practice: Screening by Chief Complaint",
      "brief_description": "\u003cb\u003eVideo Runtime: 39 Minutes; Learning Assessment Time: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course addresses the critical need for physical therapists to quickly and accurately identify conditions outside the typical scope of their practice. By equipping physical therapists with advanced evaluation techniques, the course aims to reduce the chances of delayed diagnoses and ensure that patients receive appropriate referrals to other healthcare providers when necessary. This information can be applied to various healthcare settings as the course will help physical therapists refine their clinical reasoning skills and promote effective interprofessional communication. Through case studies and practical exercises, physical therapists will learn to recognize red flags, implement referral strategies, and improve patient outcomes.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eApply advanced screening techniques to assess patient conditions and identify those requiring medical referral or additional care\n\u003c/li\u003e\n\u003cli\u003eImplement an effective referral plan to ensure seamless patient transitions between physical therapy and other healthcare services\n\u003c/li\u003e\n\u003cli\u003eDetermine when a patient’s signs or symptoms fall outside the scope of physical therapy and require intervention from other healthcare professionals\n\u003c/li\u003e\n\u003cli\u003eExamine case studies to identify common red flags and patterns indicating conditions that may necessitate referral or further evaluation\n\u003c/li\u003e\n\u003cli\u003eEvaluate history and examination results to discern underlying issues that could impact treatment outcomes and overall health\n\u003c/li\u003e\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4612/title2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Ray VanWye"
        }
      ]
    },
    {
      "title": "Exercise Dosing for Geriatric Patients With Multiple Comorbidities",
      "brief_description": "\u003cb\u003eVideo Runtime: 34 Minutes; Learning Assessment Time: 39 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course addresses the need for specialized training for physical therapists to understand exercise prescriptions for patients with complex health profiles. Physical therapists will gain comprehensive skills in assessing and integrating various clinical guidelines, such as those from the American College of Sports Medicine, to create exercise regimens that consider the interplay of multiple diseases. Emphasis is placed on the practical application of cardiopulmonary training techniques and prescribing exercises to meet the unique needs of geriatric patients. This course is designed for practicing physical therapists looking to enhance their competency in managing and improving the quality of life for their geriatric patients through personalized, safe, and effective exercise interventions.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExamine the implications of multiple comorbidities on exercise prescription to understand their interrelated impacts on exercise tolerance and safety\n\u003c/li\u003e\n\u003cli\u003eDetermine appropriate exercise dosages utilizing current clinical guidelines and specific condition-related modifications\n\u003c/li\u003e\n\u003cli\u003eApply exercise prescription principles to plan health and fitness programs for geriatric patients, considering the presence of comorbidities that may act as barriers to traditional exercise regimens\n\u003c/li\u003e\n\u003cli\u003eEvaluate case studies of geriatric patients with multiple comorbidities to prescribe exercise programs effectively, ensuring the integration of best practices and current research findings into clinical decision-making\n\u003c/li\u003e\n\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4613/ctitle3_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Ray VanWye"
        }
      ]
    },
    {
      "title": "Research Part 1: Basics and Statistics to Memorize (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 20 Minutes; Learning Assessment Time: 5 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course explores foundational research concepts and values within the context of physical therapy research and practice. While the course aims to assist examinees in preparation for a board certification exam, all practicing clinicians will be able to apply this information to interpret effect sizes, reliability, and likelihood ratios in order to make decisions about their clinical practice. At the end of the course, participants will be able to read these values in a research report and analyze how useful the test or finding will be in practice.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze how \u003ci\u003ep\u003c/i\u003e values and alpha levels affect the likelihood of type I and type II errors in physical therapy research \u003c/li\u003e\n\u003cli\u003eDetermine an intervention’s effectiveness using effect sizes reported in a research article \u003c/li\u003e\n\u003cli\u003eDetermine the reliability and clinical utility of a test using a Cohen’s kappa value reported in a research article\u003c/li\u003e\n\u003cli\u003eUse likelihood ratios to determine whether a clinical finding should result in a small or large shift in the probability of an outcome\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4649/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Research Part 2: Hawthorne, John Henry, and Pygmalion (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 16 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course examines psychological effects that have been noted to confound human clinical trials, including the placebo effect, nocebo effect, Hawthorne effect, John Henry effect, and Pygmalion effect. In addition to recognizing these effects, the course will explore common ways of controlling for these effects. While this course is primarily for individuals studying for an ABPTS specialty exam, any clinicians who conduct research or who attempt to integrate research into their practice can benefit from this material.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eChoose effective controls for the placebo effect in a research design \u003c/li\u003e\n\u003cli\u003eAnalyze a research design to identify risk for psychological biases among participants\u003c/li\u003e\n\u003cli\u003eDistinguish between the placebo effect, nocebo effect, Hawthorne effect, John Henry effect, and Pygmalion effect in a research study\u003c/li\u003e\n\u003cli\u003eConstruct research methods to control for the Hawthorne effect, John Henry effect, and Pygmalion effect in a clinical trial\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4650/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Midportion Achilles Tendinopathy Diagnosis (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 23 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course discusses the pathophysiology, epidemiology, and diagnosis of midportion Achilles tendinopathy. The course is focused on the 2018 clinical practice guideline, but it also draws from other sources to provide a more complete picture of the condition. While this course aims to assist examinees in preparation for a board certification exam, all providers who treat midportion Achilles tendinopathy will benefit from the discussion.  \n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDetermine which risk factors are likely to contribute to the development of midportion Achilles tendinopathy\u003c/li\u003e\n\u003cli\u003eChoose the most effective clinical tests for ruling in and ruling out midportion Achilles tendinopathy \u003c/li\u003e\n\u003cli\u003eUse outcome measures to determine whether patients have made clinically significant progress\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4651/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Types of Arthritis (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 30 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course aims to help clinicians recognize and distinguish between various types of arthritis and inflammatory conditions. Most attention is given to osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, and psoriatic arthritis, but we also discuss reactive arthritis, septic arthritis, and gout. Although the aim of this course is to assist physical therapists who are preparing for a board-certification exam, all clinicians who see and treat patients with rheumatoid conditions can benefit from the discussion.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDiscriminate between osteoarthritis, rheumatoid arthritis, and psoriatic arthritis given a clinical case scenario \u003c/li\u003e\n\u003cli\u003eApply clinical diagnostic criteria to rule in or out ankylosing spondylitis given a clinical case \u003c/li\u003e\n\u003cli\u003eDistinguish between reactive arthritis, septic arthritis, and gout given a clinical case\u003c/li\u003e\n\u003cli\u003eCorrelate patient pain patterns to common types of arthritis\u003c/li\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4653/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Total Knee Arthroplasty CPG (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 32 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThe APTA’s clinical practice guideline on physical therapy management of total knee arthroplasty is often missed by physical therapists in the orthopedic setting. This course disseminates the most important and applicable information from this CPG, including examination, pre- and postoperative treatment, prognosis, and discharge planning. This course will also teach how to interpret and apply this CPG’s different recommendation structure. This course is designed to assist physical therapists pursuing the ABPTS specialty but is very applicable for any physical therapist who encounters patients who have or will undergo total knee arthroplasty.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003ePrioritize the most important and effective interventions for treatment patients who have undergone total knee arthroplasty \u003c/li\u003e\n\u003cli\u003eImplement preoperative education and exercise interventions for patients who will undergo total knee arthroplasty \u003c/li\u003e\n\u003cli\u003eModify treatment plans based on specific prognostic factors in patients following total knee arthroplasty\u003c/li\u003e\n\u003cli\u003eSelect appropriate patient-reported and performance-based outcome measures for patients following total knee arthroplasty\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4654/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Headaches (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 28 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course examines the differences between common types of headaches seen in physical therapy practice. Drawing from the latest edition of the International Headache Society’s \u003ci\u003eThe International Classification of Headache Disorders, 3rd Edition,\u003c/i\u003e and the National Institute for Health and Care Excellence’s headache guidelines, we synthesize common presentations and distinguishing features of cervicogenic headaches, tension-type headaches, migraines, and cluster headaches. While the course aims to assist examinees in preparation for a board-certification exam, all physical therapists who treat headaches will benefit from this discussion.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDistinguish between cervicogenic headaches, tension-type headaches, migraines, and cluster headaches given subjective and objective findings \u003c/li\u003e\n\u003cli\u003eChoose evidence-based treatments for a patient presenting with cervicogenic headaches \u003c/li\u003e\n\u003cli\u003eChoose relevant subjective questions and objective tests to distinguish between cervicogenic headaches, tension-type headaches, migraines, and cluster headaches\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4655/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Greater Trochanteric Pain Syndrome (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 19 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nGreater trochanteric pain syndrome (GTPS) is a common condition that historically has been misunderstood and misdiagnosed. This course reviews current evidence on examination and classification-based treatment of greater trochanteric pain syndrome. Listeners will be able to differentiate GTPS from other hip pain diagnoses. Clinicians will then be able to classify patients with GTPS into specific subtypes and tailor treatment accordingly. While this course is designed for physical therapists pursuing the ABPTS specialty, this course is very applicable for any physical therapist treating adults.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExamine individuals with complaint(s) of lateral hip pain, and distinguish greater trochanteric pain from other causes of hip pain in adult populations \u003c/li\u003e\n\u003cli\u003eCategorize patients with greater trochanteric pain syndrome into various subtypes based on clinical examination when treating adults in the orthopedic setting \u003c/li\u003e\n\u003cli\u003ePlan and implement effective treatment for specific classifications of greater trochanteric pain among adults with complaint(s) of lateral hip pain\u003c/li\u003e\n\u003cli\u003eChoose interventions based on level of irritability in adult patients with greater trochanteric pain syndrome\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4656/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Midportion Achilles Tendinopathy Treatment (OCS Field Guide)",
      "brief_description": "\u003cb\u003eAudio Runtime: 25 Minutes; Learning Assessment Time: 7 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course discusses the evidence-based treatment of midportion Achilles tendinopathy. The course is focused on the 2018 clinical practice guideline, but it also draws from recent studies on exercise protocols and use of the pain-monitoring model of tendinopathy management. While this course aims to assist examinees in preparation for a board certification exam, all providers who treat midportion Achilles tendinopathy will benefit from the discussion.  \n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eCategorize recommended treatments for Achilles tendinopathy by strength of evidence \u003c/li\u003e\n\u003cli\u003eDistinguish which evidence-based treatments for midportion Achilles tendinopathy would be most appropriate for a given clinical presentation with objective findings \u003c/li\u003e\n\u003cli\u003eApply the pain-monitoring model to midportion Achilles tendinopathy treatment and return-to-sport management\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4669/ocspodcastdesign_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Austin Kercheville"
        },
        {
          "name_without_ending": "David Smelser"
        }
      ]
    },
    {
      "title": "Acute Rehab for the Perinatal Population 0–6 Weeks After Delivery (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 62 Minutes; Learning Assessment Time: 33 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course is a recording of a previously hosted live webinar event. Polling and question submission features are not available for this recording. Format and structure may differ from those of standard Medbridge courses.\n\u003cbr\u003e\u003cbr\u003e\nOver 50 percent of maternal deaths occur within the first six weeks after birth. The single largest contributing factor to maternal morbidity is cesarean delivery. Despite the well-documented benefits of postsurgical rehab for hospitalized patients, individuals who have undergone C-section do not routinely have access to occupational and physical therapy after their major open abdominal surgery. Traditionally, patients start postpartum\nrehab six weeks or more after birth, which is outside of the critical period when the\nmajority of maternal complications occur. Most maternal deaths that are associated\nwith hypertensive disorders and eclampsia occur during postpartum week 1, and the\nmajority of maternal deaths associated with infection occur between days 8 and 42.\nOccupational and physical therapists who work in the hospital and home are in a\nunique position to identify individuals who may be at greater risk for postpartum\ncomplications through evidence-based practice and the use of functional outcome\nmeasures.\n\u003cbr\u003e\u003cbr\u003e\nThis webinar will review high-quality rehab interventions and screening tools\nthat assist the maternal medical team with identifying high-risk postpartum individuals\nto improve maternal function in the immediate postpartum period.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze risk factors in the medical history that contribute to postsurgical morbidity and occupational impairments in the immediate postpartum patient population\n\u003c/li\u003e\n\u003cli\u003eImplement outcome measures specific to acute care rehabilitation to guide inpatient plans of care and outpatient referral recommendations for the postpartum patient\n\u003c/li\u003e\n\u003cli\u003eApply rehabilitation interventions to manage symptoms associated with prolonged recovery and surgical- or birth- related impairments in the perinatal population\n\u003c/li\u003e\n\u003cli\u003eDetermine effective communication strategies with the interprofessional care team to improve maternal health outcomes during the first 0–6 weeks after birth\n\u003c/li\u003e\n\u003cli\u003eExamine the current literature to assist in providing innovative intervention strategies with the immediate postpartum patient\n\u003c/li\u003e\n\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4708/image_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Jenna Segraves"
        },
        {
          "name_without_ending": "Rebeca  Segraves"
        }
      ]
    },
    {
      "title": "How Can You Make a Real Impact on Frailty, Deconditioning, and Sarcopenia?",
      "brief_description": "\u003cb\u003eAudio Runtime: 58 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eNeuro Navigators Episode 8: How Can You Make a Real Impact on Frailty, Deconditioning, and Sarcopenia?\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nDr. Carole Lewis, an esteemed expert in geriatric rehabilitation, joins host J.J. Mowder-Tinney to discuss practical pearls for managing frailty, deconditioning, and sarcopenia in older adults. Drawing on Dr. Lewis’s extensive clinical experience and research, this episode is jam-packed with key outcome measures, targeted interventions, and strategies to empower your patients toward greater independence. Listen and learn from a conversation centered around bringing hope and skill to a population that too many people overlook and underestimate.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eInterpret the evidence around older adults with sarcopenia, deconditioning, and frailty \u003c/li\u003e\n\u003cli\u003eApply evidence-based, practical strategies to facilitate improved participation in daily activities for older adults with sarcopenia, deconditioning, and frailty\u003c/li\u003e\n\u003cli\u003eSolve patient case scenarios involving older adults with sarcopenia, deconditioning, and frailty\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4665/1250hbanner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Carole B. Lewis"
        },
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        }
      ]
    },
    {
      "title": "Can Insights Into Manual Therapy Mechanisms Guide Clinical Practice?",
      "brief_description": "\u003cb\u003eAudio Runtime: 56 Minutes; Learning Assessment Time: 18 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eRehab and Performance Lab Episode 8: Can Insights Into Manual Therapy Mechanisms Guide Clinical Practice?\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nAmy McDevitt, PT, DPT, PhD, OCS, FAAOMPT, joins Phil Plisky to share her expertise on the mechanisms of manual therapy and how understanding them can elevate clinical practice. She describes the science behind manual therapy techniques, offering valuable insights for improving patient outcomes.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDescribe the specific and shared mechanisms involved in manual therapy and resistance exercise and how they influence patient outcomes\u003c/li\u003e\n\u003cli\u003eExplain the importance of the therapeutic alliance and how factors such as patient expectations and clinician-patient rapport contribute to treatment effectiveness\u003c/li\u003e\n\u003cli\u003eApply evidence-based, practical strategies to personalize treatment plans for patients while maximizing outcomes, integrating manual therapy, exercise, and patient education\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4667/1252i_rehabandperformancelabpodcast_banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Phil Plisky"
        },
        {
          "name_without_ending": "Amy  McDevitt"
        }
      ]
    },
    {
      "title": "Optimizing Documentation: Enhancing Care and Job Satisfaction (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 64 Minutes; Learning Assessment Time: 19 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eProviding excellent client-centered services depends on documentation that clearly illustrates the medical necessity of the client. In contrast, current documentation expectations play a role in a healthcare professional’s burnout, affecting both well-being and client care outcomes. By recognizing the challenges posed by documentation requirements and implementing strategies to mitigate their impact, we can support the well-being of professionals and enhance the quality of care provided to our patients. This session will address the relationship between documentation, client-centered care and healthcare professional job satisfaction, and identify key specific requirements and examples for documentation. Participants will learn strategies to impact and improve documentation and job satisfaction. This course is appropriate for providers in inpatient, outpatient, long term care, and home care settings. \n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eCompare the relationship between documentation, client-centered care, and job satisfaction\u003c/li\u003e\n\u003cli\u003eRecognize the essential components required in rehabilitation documentation\u003c/li\u003e\n\u003cli\u003eIdentify through examples and a case study what constitutes appropriate documentation\u003c/li\u003e\n\u003cli\u003eHighlight strategies to impact and improve documentation and job satisfaction\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4668/w1242_neely_sullivan_ch100_00_06_28still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Neely Sullivan"
        }
      ]
    },
    {
      "title": "OASIS-E1: Quick Guide to PDGM and HHVBP Items (Text-Only)",
      "brief_description": "\u003cb\u003eCourse Runtime: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eThe current payment methodology for Medicare Part A home health services is driven in part by eight specific items found in the OASIS instrument. Several other payers utilize OASIS data for payment purposes as well. \n\nHome Health Value Based Payment also adjusts payment upward or downward using a Total Performance Score (TPS) method,  35% of which is calculated based on OASIS accuracy. Incorrect OASIS responses to the specific items in this course can negatively impact revenue and quality measures.\n\nThis course is a quick guide focused on the items that directly relate to PDGM and HHVBP. Each text article provides information on how to collect and apply information on a specific item.",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4681/oasise1courseimage_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Cindy Krafft"
        }
      ]
    },
    {
      "title": "Introduction to Chemotherapy-Induced Peripheral Neuropathy in Adults",
      "brief_description": "\u003cb\u003eVideo Runtime: 51 Minutes; Learning Assessment Time: 29 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eChemotherapy-induced peripheral neuropathy (CIPN) in adults is a problem that has significant negative impact on quality of life and function. CIPN affects a large percentage of cancer patients and is well-suited to rehabilitation interventions. Despite this, CIPN has been underappreciated in rehabilitation education. This introductory course provides background information about CIPN and establishes the foundation necessary for the series’ subsequent courses on evaluation and treatment of CIPN in adults. This course includes videotaped interviews with people who have CIPN and highlights their experiences with the diagnosis. This course is informational to nurses and is applicable to occupational therapists and physical therapists in a variety of settings including inpatient and outpatient hospitals, outpatient private practices, skilled nursing facilities, long-term care, home health, and hospice environments.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize CIPN in adults\n\u003c/li\u003e\n\u003cli\u003eDefine the impact that CIPN can have on ADLs and social participation in adults\n\u003c/li\u003e\n\u003cli\u003eRecall the pathogenic explanations for CIPN in adults\n\u003c/li\u003e\n\u003cli\u003eDifferentiate between nerve pain and nerve impairment in adults with CIPN\n\u003c/li\u003e\n\u003cli\u003eIdentify three chemotherapy agents associated with CIPN in adults\n\u003c/li\u003e\n\u003cli\u003eName two concepts of neuroplasticity in the realm of sensory rehabilitation\n\u003c/li\u003e\n\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4531/1237a_title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Cynthia Cooper"
        }
      ]
    },
    {
      "title": "Evaluation of Chemotherapy-Induced Peripheral Neuropathy in Adults",
      "brief_description": "\u003cb\u003eVideo Runtime: 32 Minutes; Learning Assessment Time: 37 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThe evaluation of chemotherapy-induced peripheral neuropathy (CIPN) is a topic that has not been specifically addressed in rehabilitation literature. Rehabilitation for CIPN usually relies on evaluation strategies that are traditional in our field but are not necessarily suited to the unique clinical characteristics of CIPN. For example, a patient with a peripheral nerve injury does not have the same presentation as a patient with CIPN. This course provides evaluation recommendations and videotaped demonstrations to enable practitioners to select meaningful tests and interpret the findings using knowledge specific to the diagnosis of CIPN. Evaluation choices will be explained and demonstrated to maximize rehabilitation success. This course is informational to nurses and applicable to occupational therapists and physical therapists in a variety of settings, including inpatient and outpatient hospitals, outpatient private practices, skilled nursing facilities, long-term care, home health, and hospice environments.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eSelect appropriate clinical tests to evaluate an adult patient with CIPN\n\u003c/li\u003e\n\u003cli\u003eDiscriminate rationales for the use of the Ten Test versus the two-point discrimination test and/or the monofilament test in adult patients with CIPN\n\u003c/li\u003e\n\u003cli\u003eDistinguish between sensory pain and sensory impairment\n\u003c/li\u003e\n\u003cli\u003eAdminister the use of the Ten Test for sensation in the hand\n\u003c/li\u003e\n\u003cli\u003eExecute three gentle, provocative maneuvers of the upper extremity\n\u003c/li\u003e\n\u003cli\u003eCorrelate findings of provocative upper extremity tests with clinical observations and sensory test results to determine the impact on ADL and IADL performance\n\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4532/1237b_title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Cynthia Cooper"
        }
      ]
    },
    {
      "title": "Treatment of Chemotherapy-Induced Peripheral Neuropathy in Adults",
      "brief_description": "\u003cb\u003eVideo Runtime: 69 Minutes; Learning Assessment Time: 29 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nThis course presents ideas for treatment of chemotherapy-induced peripheral neuropathy (CIPN) and correlates home program recommendations to the unique neurotoxic effects of chemotherapeutic agents. This course discusses the impact of our word choices and offers suggestions for use of language that is calming and restorative. Emphasis is placed on clinical reasoning to assist in the development of individualized and creative treatment plans aimed at normalizing sensation and function. This intermediate-level course presents a variety of treatment suggestions for sensory stimulation, active range of motion, nerve and tendon slides/glides, edema control, and manual therapy. This course is informational to nurses and is applicable to occupational therapists and physical therapists in a variety of settings including inpatient and outpatient hospitals, outpatient private practices, skilled nursing facilities, long-term care, home health, and hospice environments.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eCorrelate autonomic nervous system responses to militaristic metaphors about cancer experiences\n\u003c/li\u003e\n\u003cli\u003eIntegrate sensory queries into the treatment process\n\u003c/li\u003e\n\u003cli\u003eSelect sensory stimulation treatment interventions for CIPN\n\u003c/li\u003e\n\u003cli\u003eDetermine therapeutic home program dosage including sensory stimulation for patients with CIPN\n\u003c/li\u003e\n\u003cli\u003eDetermine if the patient appears to have subclinical edema\n\u003c/li\u003e\n\u003cli\u003ePrepare a home program to address ADL and IADL deficits due to CIPN\n\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4533/1237c_title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Cynthia Cooper"
        }
      ]
    },
    {
      "title": "Are We Approaching Cueing Correctly?",
      "brief_description": "\u003cb\u003eNeuro Navigators Episode 7: Are We Approaching Cueing Correctly?\u003c/b\u003e\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eAudio Runtime: 51 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nJoin host J.J. Mowder-Tinney as she welcomes occupational therapist Melissa Kimmerling, EdD, MOT, OTR/L, an expert in neurorehabilitation. In this episode, J.J. and Melissa dive deep into the intricacies of cueing strategies, exploring recent research and practical applications for clinicians. Discover actionable insights and innovative approaches to enhance your clinical practice.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eInterpret the evidence around effective cueing strategies for clients with neurological impairments\u003c/li\u003e\n\u003cli\u003eApply evidence-based, practical strategies to actionably address cognitive impairments in practice\u003c/li\u003e\n\u003cli\u003eSolve patient case scenarios involving choosing the best cueing strategy for a provided client case\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4639/1250g_banner1_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Melissa Kimmerling"
        },
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        }
      ]
    },
    {
      "title": "Does Everyone Need Pain Neuroscience Education?",
      "brief_description": "\u003cb\u003e Rehab and Performance Lab Episode 7: Does Everyone Need Pain Neuroscience Education?\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\n\u003cb\u003eVideo Runtime: 45 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nAdriaan Louw, PT, PhD, a renowned expert in pain neuroscience education, joins the Rehab and Performance Lab podcast to reveal which types of patients really benefit from this type of education. Together with host Phil Plisky, he discusses the latest research, highlights evidence-based treatment strategies that can create independence and foster hope in your patients, and champions a compassionate approach to patient care. Tune in to learn how addressing patients' fears and helping them to understand why they hurt can improve outcomes, especially when combined with movement-based therapies.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eInterpret the evidence around pain neuroscience education\u003c/li\u003e\n\u003cli\u003eApply evidence-based, practical strategies to actionably address how to identify patients who would benefit from pain neuroscience education\u003c/li\u003e\n\u003cli\u003eSolve patient case scenarios involving pain neuroscience education\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4640/1252gbanner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Adriaan Louw"
        },
        {
          "name_without_ending": "Phil Plisky"
        }
      ]
    },
    {
      "title": "Protecting Our People: The Scope of Home Care Workplace Violence",
      "brief_description": "\u003cb\u003eProtecting Our People Episode 1: The Scope of Home Care Workplace Violence\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eAudio Runtime: 22 Minutes; Learning Assessment Time: 21 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThere is a growing problem of violence against caregivers in home-based care. In a recent survey, over 20% of caregivers reported violence at the hands of clients in the previous year, and over 30% during the course of their careers. Violence causes acute and long-term physical and emotional injury, leading to burnout, turnover, and poor patient care. Home-based care leaders need to understand the risk to individuals and the agency and options to improve safety.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize the incidence and prevalence of violence in home-based care\u003c/li\u003e\n\u003cli\u003eIdentify risk factors for violence against home-based care workers\u003c/li\u003e\n\u003cli\u003eHighlight the role of executive leaders in protecting employees\u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4643/housecallpodcastlogo_v2banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Andrea  Devoti"
        },
        {
          "name_without_ending": "Danielle Pierotti"
        }
      ]
    },
    {
      "title": "Protecting Our People: Homecare Employee Risk Is Organizational Risk",
      "brief_description": "\u003cb\u003eProtecting Our People Episode 2: Homecare Employee Risk Is Organizational Risk\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eAudio Runtime: 25 Minutes; Learning Assessment Time: 13 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThere is a growing problem of violence against caregivers in home-based care. In a recent survey, over 20% of caregivers reported violence at the hands of clients in the previous year, and over 30% during the course of their careers. Violence causes acute and long-term physical and emotional injury, leading to burnout, turnover, and poor patient care. Home-based care leaders need to understand the risk to individuals and the agency and options to improve safety.\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify the five pillars of safety defined by the NAHC’s call to action\u003c/li\u003e\n\u003cli\u003eRecognize the role of culture in safety \u003c/li\u003e\n\u003cli\u003eHighlight the challenges of communicating about safety and risk in agency \u003c/li\u003e\n\u003c/ul\u003e\n\u003cb\u003eThis is an audio-only course. Additional materials are available for download within the course. To receive continuing education credit, complete the course and the accompanying quiz.\u003c/b\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4644/housecallpodcastlogo_v2banner_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Andrea  Devoti"
        },
        {
          "name_without_ending": "Danielle Pierotti"
        },
        {
          "name_without_ending": "Jeff Salter"
        },
        {
          "name_without_ending": "Lori Bonderson"
        }
      ]
    },
    {
      "title": "Mitigating Burnout: Tools for Yourself and Your Team (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 100 Minutes; Learning Assessment Time: 19 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nHealthcare professionals are at high risk of burnout, which is associated with decreased job satisfaction, increased medical errors, and decreased mental well-being. This session is designed for healthcare professionals looking to combat burnout and promote a healthier work environment for themselves and their teams.\nParticipants will start by exploring the importance of addressing workplace burnout. We’ll examine relevant data and trends within the healthcare sector, helping attendees understand why tackling burnout is vital for both individual well-being and organizational health. You will learn how to identify characteristics of burnout and how to self-assess your current stress levels.\nNext, we’ll delve into practical, evidence-based strategies for mitigating burnout and explore the theory behind burnout. Attendees will develop personalized action plans to prevent burnout, focusing on practical steps to maintain their own well-being as well as that of their teams.\n\nDuring the webinar, participants will be able to download a workbook to complete and a tool kit they can use for themselves and their team to foster a resilient and thriving work environment. Don’t miss this opportunity to transform your approach to burnout management.\n\nThis webinar is a follow-up to a previous webinar, \u003ci\u003e\u003ca href=\"https://www.medbridge.com/courses/details/4481\" target=\"_blank\"\u003e Mitigating Burnout: Introducing a Coach Approach in Healthcare\u003c/a\u003e\u003c/i\u003e. While watching the previous course is not a prerequisite for this webinar, it is a helpful resource.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify the significance of addressing workplace burnout\u003c/li\u003e\n\u003cli\u003eRecognize the three defining characteristics of burnout\u003c/li\u003e\n\u003cli\u003eInterpret your current level of burnout\u003c/li\u003e\n\u003cli\u003eList the benefits of diaphragmatic breathing for stress management\u003c/li\u003e\n\u003cli\u003eClarify the theory behind burnout\u003c/li\u003e\n\u003cli\u003eBuild a personalized action plan to prevent burnout for yourself and for your team\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4659/w1264_helene_theriault_ch100_00_06_25still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Hélène Thériault"
        }
      ]
    },
    {
      "title": "Interdisciplinary Treatment of the Long COVID Patient (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 86 Minutes; Learning Assessment Time: 34 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nThis course is a recording of a previously hosted live webinar event. Polling and question submission features are not available for this recording. Format and structure may differ from those of standard MedBridge courses.\u003cbr\u003e\u003cbr\u003e\n\nFatigue, postexertional malaise, and cognitive impairment are among the most prevalent symptoms of long COVID. Because of the novelty of this population, there is limited research, clinical guidance, or awareness of rehabilitation’s role in long-COVID management. Physical therapists, occupational therapists, and speech-language pathologists are in unique positions to help optimize outcomes in long COVID given their experience addressing similar functional impairments in other patient populations.\u003cbr\u003e\u003cbr\u003e\nThis webinar is a sequel to \u003ci\u003e\u003ca href=\"https://www.medbridge.com/courses/details/interdisciplinary-management-and-screening-of-the-long-covid-patient-recorded-webinar-rebecca-boersma-becca-krysiak-corey-malone\" target=\"_blank\"\u003eInterdisciplinary Management and Screening of the Long-COVID Patient\u003c/a\u003e\u003c/i\u003e. This presentation will assist practitioners in identifying appropriate treatment techniques for the long-COVID patient. By attending this session, participants can expect to feel more equipped to provide intervention to the long-COVID population with an individualized, person-centered approach. \n\u003cbr\u003e\u003cbr\u003e\n\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eConstruct the definition of long COVID in order to provide clarity for patient education\u003c/li\u003e\n\n\u003cli\u003eAnalyze typical symptoms associated with long COVID as well as common premorbid and comorbid conditions impacting patient participation in daily activities\u003c/li\u003e\n\n\u003cli\u003eDetermine rehab specialist strengths for patients with long COVID\u003c/li\u003e\n\n\u003cli\u003eApply knowledge of person-centered, multidisciplinary treatment approaches in the long-COVID population\u003c/li\u003e\n\n\u003cli\u003ePlan evidence-based treatment techniques and approaches to optimize patient function and recovery\u003c/li\u003e\n\n\u003cli\u003eDetermine manual therapy techniques supported in the literature that can support a patient’s recovery with minimal to no adverse effects\u003c/li\u003e\n\u003c/ul\u003e\n\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4657/w1263coursestill_v2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Rebecca Boersma"
        },
        {
          "name_without_ending": "Rachel Johansen Bracken"
        },
        {
          "name_without_ending": "Becca Krysiak"
        }
      ]
    },
    {
      "title": "Say No to the Faux: Dubious Diet Trends, Tests, and Supplements",
      "brief_description": "\u003cb\u003eVideo Runtime: 62 Minutes; Learning Assessment Time: 40 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nIn the quest to optimize performance, athletes may be tempted to try unproven, potentially harmful, or useless testing, resulting in nutrient exclusion, increased reliance on supplementation, and adverse consequences for health. As the gatekeepers and athletes’ advocates, our responsibility is to dissuade athletes from questionable practices and guide them to recommendations based on science over speculation.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExamine the impact of food/nutrient elimination without justification based on non-science-based blood tests\u003c/li\u003e\n\u003cli\u003eApply recommendations for caffeine use as an ergogenic aid while determining the impact on health and performance\u003c/li\u003e\n\u003cli\u003eAnalyze the detrimental health and performance consequences of extreme eating patterns\u003c/li\u003e\n\u003cli\u003eImplement recommendations for safe supplementation based on evidence, blood work, and individual goals\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4484/c1220b_bonci_anding_ch300_08_49_02still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Leslie Bonci"
        },
        {
          "name_without_ending": "Roberta Anding"
        }
      ]
    },
    {
      "title": "Master Athletes",
      "brief_description": "\u003cb\u003eVideo Runtime: 59 Minutes; Learning Assessment Time: 41 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nAre you a dedicated physical therapist or athletic trainer looking to elevate your skills and make a lasting impact on the world of sports and fitness? This course is tailor-made for professionals like you who are ready to specialize in working with master athletes.\n\nIn this course, you will dive into the unique needs and challenges faced by master athletes, whose commitment to peak performance knows no age limits. Gain an understanding of the physiology, common comorbidities, and postoperative considerations for aging athletes.\n\nWhether you’re a seasoned professional or are just starting your career, this course will empower you to provide unparalleled care and support to master athletes, ensuring they continue to excel in their chosen sports. Learn how to become a vital player in the success stories of master athletes everywhere.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze the definition of a master athlete \u003c/li\u003e\n\u003cli\u003eDistinguish the demographics of master athletes \u003c/li\u003e\n\u003cli\u003eDetermine the physiology of normal aging, common comorbidities, and orthopedic injuries that affect master athletes\u003c/li\u003e\n\u003cli\u003ePlan evidence-based interventions for the common orthopedic conditions in this population\u003c/li\u003e\n\u003cli\u003eImplement considerations for return to sport following orthopedic surgeries in master athletes\u003c/li\u003e\n\u003cli\u003eAnalyze the benefits of lifelong participation in sports\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4488/c1239a_shaibi_ch200_16_44_14still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Stefany Shaibi"
        }
      ]
    },
    {
      "title": "Mentorship Matters: Building Bridges to Success",
      "brief_description": "\u003cb\u003eVideo Runtime: 78 Minutes; Learning Assessment Time: 47 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nHave you had a high turnover rate of new clinicians in your practice? Are you looking for ways to improve morale at your workplace? This course is tailor-made for those who are ready to improve their practice setting through a mentorship program.\n\nIn this course, you will learn about the concerns faced by many new clinicians as they enter the healthcare workforce. This will include a discussion about generational differences. You will also gain an understanding of the evidence-based mentorship strategies and the benefits of mentorship.\n\nIf you are a seasoned professional, administrator, or practice owner, this course will enable you to provide effective mentorship to improve employee retention and job satisfaction. If you are a new clinician, this course will provide you with methods to facilitate mentorship early in your career.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExtrapolate common new clinician concerns as they enter the workforce \u003c/li\u003e\n\u003cli\u003eEvaluate the generational differences of new clinicians \u003c/li\u003e\n\u003cli\u003eIntegrate evidence-based mentorship for new clinicians\u003c/li\u003e\n\u003cli\u003eGeneralize the aspects of providing effective feedback to a new clinician\u003c/li\u003e\n\u003cli\u003eAssess the benefits of mentorship\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4489/c1239b_shaibi_ch300_01_00_23still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Stefany Shaibi"
        }
      ]
    },
    {
      "title": "Nutrition for Gastrointestinal Issues in Active Individuals",
      "brief_description": "\u003cb\u003eVideo Runtime: 56 Minutes; Learning Assessment Time: 37 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nIt has been estimated that 30%–50% of athletes suffer from some type of digestive issues during training and/or competition. This can affect performance outcomes in terms of quality of training or even finishing events during competition.\n\u003cbr\u003e\u003cbr\u003e\nThe prevalence of GI distress in active individuals can vary from 30% to 90% depending upon the sport. The wide range in reporting GI distress in the various studies is due to how symptoms are reported and how symptoms are defined. Digestive distress is more common in extreme environmental conditions and endurance sports and is more prevalent among individuals who already have GI issues such as celiac, lactose intolerance, and functional bowel disorders. In addition, overly restrictive diets, drastic and sudden changes in diet, excessive use of supplements, meal timing, food quantity, and hydration status can adversely impact gastrointestinal function.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eExamine the physiological and mechanical changes in exercise that can contribute to gut issues in active individuals\u003c/li\u003e\n\u003cli\u003eDetermine the prevalence and causes of upper and lower gastrointestinal symptoms as well as related symptoms\u003c/li\u003e\n\u003cli\u003eImplement nutrition-focused physical findings\u003c/li\u003e\n\u003cli\u003eAnalyze the role of diet as a contributor to digestive distress in active individuals\u003c/li\u003e\n\u003cli\u003eImplement a comprehensive interdisciplinary plan of action for active individuals with gastrointestinal issues\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4483/c1220a_bonci_anding_ch100_04_07_21still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Roberta Anding"
        },
        {
          "name_without_ending": "Leslie Bonci"
        }
      ]
    },
    {
      "title": "Neuro Summit Part 1: Novel and Practical Applications of Intensity in Neurorehabilitation (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 190 Minutes; Learning Assessment Time: 45 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nAttempting to translate the science of intensity can feel awkward, burdensome, and even painful for today’s practitioner. In this summit, master clinicians, instructors, and academicians Drs. Mike Studer and J.J. Mowder-Tinney will provide practitioners with applications that translate the science of intensity with fidelity by delivering novel and practical applications of intensity in neurorehabilitation. Be ready to redefine and expand your clinical applications of intensity so that repetitions are more meaningful and patients are optimally engaged.\n\u003cbr\u003e\u003cbr\u003e\nTo facilitate clinical application and increase therapists’ confidence level, the presenters will incorporate extensive videos of patient activities, case studies, and engaging Q\u0026A sessions driven by webinar attendees, leaving attendees with practical strategies that can be immediately applied in the clinic.\n\u003cbr\u003e\u003cbr\u003e \nExpect to walk away from this engaging summit with so much novel information about intensity that your walk might become a pain-free run!\n\u003cbr\u003e\u003cbr\u003e\nThis is part 1 of the Neuro Summit. Be sure to register for Neuro Summit Part 2: Optimizing Post-Stroke Rehabilitation With the Use of AFOs and FES.\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eBuild interventions that leverage three different expressions of intensity\n\u003c/li\u003e\n\u003cli\u003eDetermine the evidence for and applications of intensity for persons with acute neurologic impairment and those with chronic expressions or degenerative conditions\n\u003c/li\u003e\n\u003cli\u003eAssess motor learning approaches and their respective expressions of intensity, as well as their impact on performance of daily activities\n\u003c/li\u003e\n\u003cli\u003eAdapt the task and environment to increase intensity while maintaining safety during performance of daily activities\n\u003c/li\u003e\n\u003cli\u003eAnalyze clinical challenges to address complex rehabilitative issues\n\u003c/li\u003e\n\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4645/title2_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "J.J. Mowder-Tinney"
        },
        {
          "name_without_ending": "Mike Studer"
        }
      ]
    },
    {
      "title": "Musical Theatre Dance: Screening and Backstage Care",
      "brief_description": "\u003cb\u003eVideo Runtime: 50 Minutes; Learning Assessment Time: 37 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eEffective evaluation and treatment of musical theatre dance–specific injuries can be a challenge for physical therapists who are not familiar with the variety of demands of this population. Many therapists may be experts at treating injuries, but treating this athletic population can be a daunting task. This course will introduce clinicians to the wide range of special considerations when evaluating a musical theatre dancer for treatment. It will teach how to create and perform a proper formal assessment and identify body stressors that are individualized for the show. It will enhance clinical decision-making for proper plan of care and rehabilitation for the musical theatre dancer.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eApply functional assessments to properly identify dysfunctional movement patterns\n\u003c/li\u003e\n\u003cli\u003eDetermine aspects of the show that make the musical theatre performer more susceptible to injury\n\u003c/li\u003e\n\u003cli\u003eExamine common conditions and injuries unique to musical theatre dancers\n\u003c/li\u003e\n\u003cli\u003eImplement proper backstage care for the musical theatre dancer\n\u003c/li\u003e\n\u003cli\u003eAnalyze common movement restrictions amongst musical theatre dancers\n\u003c/li\u003e\n\u003cli\u003ePlan rehabilitation protocols that are individualized to each performer\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4436/c1204a_kantor_ch100_10_28_15still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Jenna Kantor"
        }
      ]
    },
    {
      "title": "Musical Theatre Dance: Heels Evaluation, Biomechanics, and Injuries",
      "brief_description": "\u003cb\u003eVideo Runtime: 84 Minutes; Learning Assessment Time: 43 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eKnowing how to effectively treat a musical theatre dancer who performs in heels is no simple feat. While it may be straightforward to assist a nondancer in walking in heels, this scenario differs greatly from what we were taught in school. Introducing dance into the equation leads to a notable shift in the center of gravity, the muscles utilized, and those left unused, as well as balance and movement kinematics. This course aims to educate clinicians on the proper methods for screening, assessing, rehabilitating, and preventing injuries associated with dancing in heels.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze how the center of gravity changes when wearing heels\n\u003c/li\u003e\n\u003cli\u003eDetermine specific exercises that would address the necessary strength and stability for dancing in heels\n\u003c/li\u003e\n\u003cli\u003eDevelop a method to properly educate the dancer on how to effectively train to dance in heels in a manner that prevents injuries\n\u003c/li\u003e\n\u003cli\u003eDetermine common conditions and injuries unique to people who dance in heels\n\u003c/li\u003e\n\u003cli\u003eImplement investigative questions to better identify which specific aspects of dancing in heels are a physical challenge\n\u003c/li\u003e\n\u003cli\u003eApply a screening that is specific to performers who dance in heels to identify their movement limitations\n\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4437/c1204b_kantor_ch100_06_19_28still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Jenna Kantor"
        }
      ]
    },
    {
      "title": "Musical Theatre Dance: Singing Assessment and Plan of Care",
      "brief_description": "\u003cb\u003eVideo Runtime: 48 Minutes; Learning Assessment Time: 43 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eWhen it comes to dancers who also sing, it is rightfully assumed that vocal therapists, ENTs, voice teachers, vocal coaches, and other experts specializing in voice care would be the appropriate professionals to consult. However, recent evidence and practice have shown that physical therapists have gradually become an essential component of promoting vocal health. Given that singing requires proper posture, a flexible body that maintains the health and openness of the vocal cords, and supportive breathing, it is logical to recognize the potential benefits of physical therapy for singers. In this course, clinicians will acquire the necessary skills to provide physical therapy specifically designed for musical theatre dancers who also sing, thereby empowering them to thrive vocally.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDetermine the muscles needed for strength, stability, and overall breath support when dancing\n\u003c/li\u003e\n\u003cli\u003eExamine the common habits dancers exhibit when trying to sing while dancing\n\u003c/li\u003e\n\u003cli\u003eImplement a proper assessment to identify the individual dancer’s current strengths and weaknesses when singing\n\u003c/li\u003e\n\u003cli\u003eAnalyze all body systems to ensure that there is a complete understanding of what obstacles need to be addressed to sing with more ease\n\u003c/li\u003e\n\u003cli\u003eDevelop a list of medical professionals in your vicinity to refer to in case the vocal limitations extend beyond physical therapy or speech-language pathology\n\u003c/li\u003e\n\u003cli\u003eApply a checklist of manual and therapeutic exercise treatments that can help improve vocal support, sound, and ease\n\u003c/li\u003e\n\u003cli\u003eAnalyze the research that investigates common injuries among singers\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4438/c1204c_kantor_ch300_02_38_28still003_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Jenna Kantor"
        }
      ]
    },
    {
      "title": "Vestibular Rehabilitation for the Emergency and Acute Care Provider (Recorded Webinar)",
      "brief_description": "\u003cb\u003eVideo Runtime: 180 Minutes; Learning Assessment Time: 33 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\n\nJoin us for this evidence-based webinar that will train practitioners in the practical rehabilitative management of vestibular disorders within the emergency department and acute care setting. Prompt identification and rehabilitative treatment of peripheral vestibular disorders (including BPPV) enhances patient outcomes and care efficiency. The webinar will include a review of relevant peripheral and central vestibular system anatomy and physiology, discussion of pathologies that present with acute dizziness, and overview of bedside vestibular examination and treatment skills. Indications for further medical management and red flags will be emphasized, as well as how to manage barriers to effective care. The material will be presented using lecture, video case review, and demonstration of examination and treatment techniques. The content is intended to enhance the practitioner’s ability to identify appropriate candidates for and properly administer vestibular rehabilitation therapy (VRT). This webinar is primarily intended for occupational or physical therapists practicing vestibular rehabilitation in the emergency department or acute care setting. The content is also applicable to inpatient rehabilitation and quick-access outpatient settings.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDetermine features of vestibular anatomy and physiology critical to management of acute vestibular disorders \u003c/li\u003e\n\u003cli\u003eAnalyze differentiating features of peripheral disorders in patients presenting with acute vestibular symptoms \u003c/li\u003e\n\u003cli\u003ePrioritize examination procedures to enhance the differential diagnosis process in patients with acute vestibular symptoms\u003c/li\u003e\n\u003cli\u003eImplement evidence-based treatment and patient education strategies for acute vestibular hypofunction in order to facilitate improved participation in daily activities\u003c/li\u003e\n\u003cli\u003eImplement evidence-based treatment and patient education strategies for BPPV within the emergency department and acute care setting in order to facilitate improved participation in daily activities\u003c/li\u003e\n\u003cli\u003eDistinguish features of central nervous system origin dizziness in patients presenting with acute vestibular symptoms\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4630/w1260_walter_ch300_21_51_21still002_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Jeff Walter"
        }
      ]
    },
    {
      "title": "Safety in Home-Based Care: Communication Strategies",
      "brief_description": "\u003cb\u003eVideo Runtime: 33 Minutes; Learning Assessment Time: 18 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nEveryday healthcare and social service providers are presented with complex situations that require high-level communication skills to navigate. However, most practitioners are provided with little training during their education and in their continuing education on communication techniques. In particular, for those practitioners working in the home health environment (therapy, nursing, and social work), the solitary nature of the environment often requires that a practitioner be prepared to handle conversations on their own, in real time. Thus, the goal of this course is to add to a practitioner’s base level of knowledge regarding boundary setting and navigating difficult conversations in healthcare. Practitioners will learn strategies for limit setting, conflict resolution, and engaging in conversations on sensitive topics.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eList strategies for setting limits with clients\n\u003c/li\u003e\n\u003cli\u003eIdentify strategies for handling conflict between the clinician and the client\n\u003c/li\u003e\n\u003cli\u003eHighlight strategies for handling conflicts between clients and family members\n\u003c/li\u003e\n\u003cli\u003eRecognize strategies for engaging in conversations around sensitive or difficult topics with clients and family members\n\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4591/1255title_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Quinn Tyminski"
        }
      ]
    },
    {
      "title": "Safety in Home-Based Care: Addressing Mental Illness",
      "brief_description": "\u003cb\u003eVideo Runtime: 31 Minutes; Learning Assessment Time: 18 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nRates of mental illness continue to increase in the United States while many healthcare professionals remain underprepared to address the accompanying symptoms and crises. When working in homes and communities, home health practitioners are often placed in a unique situation of being the first, and often only, healthcare provider to be present during a mental health crisis. Thus, home healthcare providers (therapy professionals, nursing, and social work) need to be trained to intervene and address issues of mental illness and substance use when they arise. This course aims to provide quick tips for providers who enter the home and other community contexts to address mental health crises. Issues of substance use, suicidality, and crisis intervention will be addressed.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eRecognize the signs that an individual is having a mental health crisis\n\u003c/li\u003e\n\u003cli\u003eIdentify appropriate methods to intervene in a mental health crisis\n\u003c/li\u003e\n\u003cli\u003eCompare methods of intervening in a mental health crisis when substance use may be present\n\u003c/li\u003e\n\u003cli\u003eList methods of intervention when suicidality is present\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4592/c1255b_quinn_tyminski_ch100_07_34_00still004_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Quinn Tyminski"
        }
      ]
    },
    {
      "title": "Safety in Home-Based Care: Situational Awareness",
      "brief_description": "\u003cb\u003eVideo Runtime: 28 Minutes; Learning Assessment Time: 24 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003e\nHealthcare practitioners entering community and home contexts are often unprepared to care for their own safety. In particular, unsafe situations such as violence, animal encounters, and substance use are often under-discussed, and practitioners are rarely trained on handling these situations. Thus in this course, practitioners will learn strategies for being more cognizant of their safety, address safety in a variety of situations, and consider how their own emotions and mental well-being impact their overall safety. An interview with a law enforcement office will provide additional information on safety that can be applied to healthcare practice.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eIdentify threats to personal safety within the home-based environment\n\u003c/li\u003e\n\u003cli\u003eHighlight interventions to mitigate or limit threats to personal or psychological safety in the home-based environment\n\u003c/li\u003e\n\u003cli\u003eRecognize how mental well-being and emotional health are impacted by their safety during the workday in the home-based setting\n\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4593/c1255c_tyminski_ch200_02_55_18still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Quinn Tyminski"
        }
      ]
    },
    {
      "title": "AFO and FES Poststroke: Principles and Parameters",
      "brief_description": "\u003cb\u003eVideo Runtime: 52 Minutes; Learning Assessment Time: 36 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eThis course will discuss the principles of AFO and FES use to address gait deficits and function poststroke, including AFO design features and electrical stimulation parameters. A patient-centered decision-making framework will be demonstrated through clinical case examples.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eDetermine gait deficits that may benefit from AFO or FES\u003c/li\u003e\n\u003cli\u003eAnalyze AFO and FES features\u003c/li\u003e\n\u003cli\u003eApply AFO and FES principles to select an appropriate device\u003c/li\u003e\n\u003cli\u003ePrioritize AFO types and FES for patients poststroke based on gait deficits and the physical therapy examination\u003c/li\u003e\n\u003c/ul\u003e\n",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4579/c1258a_johnston_brown_ch200_00_47_04still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Lisa E. Brown"
        },
        {
          "name_without_ending": "Therese E. Johnston"
        }
      ]
    },
    {
      "title": "AFO and FES Poststroke: Impact on Gait and Function",
      "brief_description": "\u003cb\u003eVideo Runtime: 57 Minutes; Learning Assessment: 31 Minutes\u003c/b\u003e\u003cbr\u003e\u003cbr\u003eThe application of ankle-foot orthoses (AFO) and functional electrical stimulation (FES) to address the activity limitations and participation restrictions of individuals with neurologic conditions is common practice. The Clinical Practice Guideline for the Use of Ankle-Foot Orthosis and Functional Electrical Stimulation Post-Stroke provides evidence to guide physical therapists in the shared decision-making process. This course will introduce a patient-centered decision-making framework and demonstrate application through clinical case examples. Each case will present a patient-specific participation and activity limitation common to individuals with neurologic conditions. The potential device effects will be discussed, and a comparison of various FES and AFO types and their potential impact will be illustrated to determine the most appropriate device types. Clinical decision-making considerations will be highlighted to emphasize the need for a patient-centered approach to best meet the needs of the individual. Evidence from the CPG will be highlighted in each case and integrated throughout the presentation to further guide decision-making.\n\u003cbr\u003e\u003cbr\u003e\n\u003cb\u003eLearning Objectives\u003c/b\u003e\n\u003cul\u003e\n\u003cli\u003eAnalyze the available evidence and clinical practice guideline recommendations to support the use of AFO and FES in individuals poststroke\u003c/li\u003e\n\u003cli\u003eDetermine device effects on gait and function\u003c/li\u003e\n\u003cli\u003eApply a shared clinical decision-making framework\u003c/li\u003e\n\u003cli\u003eIntegrate the available evidence for the use of AFO and FES, knowledge of gait subtasks, and results of a patient examination into the shared clinical decision-making for a patient/client case\u003c/li\u003e\n\u003c/ul\u003e",
      "hero_image": "https://medbridgeuploads.s3.amazonaws.com/Course/4580/c1258b_johnston_brown_ch400_09_46_09still001_hero.jpg",
      "instructors": [
        {
          "name_without_ending": "Lisa E. Brown"
        },
        {
          "name_without_ending": "Therese E. Johnston"
        }
      ]
    }
  ]
}